
#### Terraform Plan 📖
* **Proyecto (Workspace):** `tech-talk-demo2`
* **Fichero de definición:** `project-definitions/demo-tech-talk.tfvars`
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_project_iam_binding.project_iam["roles/viewer"] will be created
  + resource "google_project_iam_binding" "project_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "user:raul.makendengue@devotream.com",
        ]
      + project = (known after apply)
      + role    = "roles/viewer"
    }

  # google_project_organization_policy.org_policies["iam.allowedPolicyMemberDomains"] will be created
  + resource "google_project_organization_policy" "org_policies" {
      + constraint  = "iam.allowedPolicyMemberDomains"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = (known after apply)
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all    = false
              + values = [
                  + "devoteam.com",
                ]
            }
        }
    }

  # module.project_factory.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + deletion_policy     = "PREVENT"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + folder_id           = "766069960998"
      + id                  = (known after apply)
      + name                = "tech-talk-demo2"
      + number              = (known after apply)
      + project_id          = (known after apply)
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
        # (1 unchanged attribute hidden)
    }

  # module.project_factory.module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DISABLE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.project_factory.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id                   = "project-service-account"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "tech-talk-demo2 Project Service Account"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = (known after apply)
      + unique_id                    = (known after apply)
    }

  # module.project_factory.module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "artifactregistry.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "cloudbuild.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "container.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iam.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["run.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "run.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "serviceusage.googleapis.com"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cicd_service_account_email      = "No creada."
  + cicd_tfstate_backend_bucket     = "No creado."
  + cicd_workload_identity_provider = "No creado."
  + project_id                      = (known after apply)
  + project_number                  = (known after apply)

```
**Acción Requerida:** Un revisor debe [aprobar el despliegue](https://github.com/demo-project-factory/tech-talk-demo/actions/runs/18965821085) para continuar con el `apply`.
